In [118]:
import numpy as np

In [119]:
import pandas as pd

In [120]:
data = pd.Series([1,2,3,4,5])

In [121]:
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [122]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [123]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [124]:
data[0]

1

In [125]:
data[1:3]

1    2
2    3
dtype: int64

In [126]:
data[4]

5

In [127]:
data = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

In [128]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [129]:
data['c']

3

In [130]:
data = pd.Series(dict(a=1, b=2, c=3, d=4, e=5))

In [131]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [132]:
data['b':'d']

b    2
c    3
d    4
dtype: int64

In [133]:
data = pd.Series({'a':1, 'b':2, 'c':3, 'd':4, 'e':5})

In [134]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [135]:
data['b':'d']

b    2
c    3
d    4
dtype: int64

In [136]:
series_1 = pd.Series(dict(a=1, b=2, c=3, d=4, e=5))

In [137]:
series_2 = pd.Series(dict(a=11, b=12, c=13, d=14, e=15))

In [138]:
df = pd.DataFrame({'column_1':series_1, 'column_2':series_2})

In [139]:
df

   column_1  column_2
a         1        11
b         2        12
c         3        13
d         4        14
e         5        15

In [140]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [141]:
df.columns

Index(['column_1', 'column_2'], dtype='object')

In [142]:
df['column_1']

a    1
b    2
c    3
d    4
e    5
Name: column_1, dtype: int64

In [143]:
df['a']

KeyError: 'a'

In [144]:
df['column_1']['a']

1

In [145]:
df['column_2']['c']

13

In [146]:
df2 = pd.DataFrame(
    [[1,2],[11,12], [21, 22]], index=['a', 'b', 'c'], columns=['col_1', 'col_2']
)

In [147]:
df2

   col_1  col_2
a      1      2
b     11     12
c     21     22

In [148]:
df2 = pd.DataFrame(
    [[1,2,3],[11,12,13]]
    ,index=['a', 'b']
    , columns=['col_1', 'col_2', 'col_3']
)

In [149]:
df2

   col_1  col_2  col_3
a      1      2      3
b     11     12     13

In [150]:
df.at['a', 'column_1']

1

In [151]:
df.at['b', 'column_2'] = 100

In [152]:
df

   column_1  column_2
a         1        11
b         2       100
c         3        13
d         4        14
e         5        15

In [153]:
df.iat[2, 0]

3

In [154]:
df.iat[3, 1] = 1000

In [155]:
df

   column_1  column_2
a         1        11
b         2       100
c         3        13
d         4      1000
e         5        15

In [156]:
df.loc['b':'d', 'column_1']

b    2
c    3
d    4
Name: column_1, dtype: int64

In [157]:
df.loc['d':'e', 'column_1':'column_2'] = [[0.1, 0.2], [0.3, 0.4]]

In [158]:
df

   column_1  column_2
a       1.0      11.0
b       2.0     100.0
c       3.0      13.0
d       0.1       0.2
e       0.3       0.4

In [159]:
df.iloc[[1,3], [0, 1]]

   column_1  column_2
b       2.0     100.0
d       0.1       0.2

In [160]:
df.iloc[[2,4],[0,1]] = [[1001,1002],[1003,1004]]

In [161]:
df

   column_1  column_2
a       1.0      11.0
b       2.0     100.0
c    1001.0    1002.0
d       0.1       0.2
e    1003.0    1004.0

In [162]:
df.iloc[[0,1],[0,1]] = [[3.1,1.4],[2.2,6.8]]

In [163]:
df

   column_1  column_2
a       3.1       1.4
b       2.2       6.8
c    1001.0    1002.0
d       0.1       0.2
e    1003.0    1004.0

In [164]:
df.to_csv('df_data.csv')

In [165]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\cre\appdata\local\programs\python\python38\lib\site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in c:\users\cre\appdata\local\programs\python\python38\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.1.1; however, version 22.1.1 is available.
You should consider upgrading via the 'c:\users\cre\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

In [166]:
df2.to_excel('df2_data.xlsx')

In [167]:
df3 = pd.read_csv('df_data.csv')

In [168]:
df4 = pd.read_excel('df2_data.xlsx')

In [169]:
df2

   col_1  col_2  col_3
a      1      2      3
b     11     12     13

In [170]:
df3

  Unnamed: 0  column_1  column_2
0          a       3.1       1.4
1          b       2.2       6.8
2          c    1001.0    1002.0
3          d       0.1       0.2
4          e    1003.0    1004.0

In [171]:
df4

  Unnamed: 0  col_1  col_2  col_3
0          a      1      2      3
1          b     11     12     13

In [172]:
df3 = pd.read_csv('df_data.csv',index_col=0)

In [175]:
df3

   column_1  column_2
a       3.1       1.4
b       2.2       6.8
c    1001.0    1002.0
d       0.1       0.2
e    1003.0    1004.0

In [ ]:
df4 = pd.read_excel('df2_data.xlsx',index_col=0)

In [176]:
df4

   col_1  col_2  col_3
a      1      2      3
b     11     12     13